---
kind: method
id: M:Autodesk.Revit.DB.TransmissionData.Dispose
source: html/13b9f9f6-0628-e4fa-04db-1da44408c910.htm
---
# Autodesk.Revit.DB.TransmissionData.Dispose Method

Releases all resources used by the TransmissionData

## Syntax (C#)
```csharp
public void Dispose()
```